package task10;

/*
Вариант 18
2 3 5 6 7
2: Написать регулярное выражение определяющее является ли данная строчка GUID с или без скобок.
   Где GUID это строчка, состоящая из 8, 4, 4, 4, 12 шестнадцатеричных цифр разделенных тире.

3: Написать регулярное выражение определяющее является ли заданная строка правильным MAC-адресом.

5: Написать регулярное выражение определяющее является ли данная строчка датой в формате dd/mm/yyyy. Начиная с 1600 года до 9999 года

6: Написать регулярное выражение определяющее является ли данная строчка валидным E-mail

7: Составить регулярное выражение, является ли заданная строчка IP адресом, записанным в десятичном виде
*/

public class Runner {

}
